In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("loan.csv")

In [3]:
df.head(5)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,LoanAmount
0,LP1000,Male,Yes,2,Graduate,No,16337,370.0
1,LP1001,NaN,Yes,0,Graduate,NaN,24986,280.0
2,LP1002,Female,Yes,0,Graduate,No,8812,190.0
3,LP1003,Female,Yes,3+,Graduate,No,6820,340.0
4,LP1004,Male,No,2,Graduate,No,14716,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Loan_ID          100 non-null    object
 1   Gender           91 non-null     object
 2   Married          97 non-null     object
 3   Dependents       90 non-null     object
 4   Education        100 non-null    object
 5   Self_Employed    83 non-null     object
 6   ApplicantIncome  100 non-null    int64
 7   LoanAmount       82 non-null     float64
dtypes: float64(1), int64(1), object(6)
memory usage: 6.4+ KB

In [5]:
df.isnull().sum()

Loan_ID             0
Gender              9
Married             3
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount         18
dtype: int64

In [6]:
df["Dependents"].unique()

array(['2', '0', '3+', '1', nan], dtype=object)

In [7]:
df["Dependents"].fillna(df["Dependents"].mode()[0],inplace=True)

In [8]:
df["Dependents"].unique()

array(['2', '0', '3+', '1'], dtype=object)

In [9]:
df["Dependents"].value_counts()

Dependents
0     39
2     27
3+    21
1     13
Name: count, dtype: int64

In [10]:
new = df["Dependents"].replace("3+","4")

In [11]:
new.head(10)

0    2
1    0
2    0
3    4
4    2
5    0
6    0
7    2
8    0
9    0
Name: Dependents, dtype: object

In [15]:
df["Dependents"] = pd.DataFrame(new).astype("int64")

In [16]:
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,LoanAmount
0,LP1000,Male,Yes,2,Graduate,No,16337,370.0
1,LP1001,NaN,Yes,0,Graduate,NaN,24986,280.0
2,LP1002,Female,Yes,0,Graduate,No,8812,190.0
3,LP1003,Female,Yes,4,Graduate,No,6820,340.0
4,LP1004,Male,No,2,Graduate,No,14716,NaN
...,...,...,...,...,...,...,...,...
95,LP1095,Female,Yes,2,Not Graduate,No,8441,60.0
96,LP1096,Female,No,4,Not Graduate,No,24886,490.0
97,LP1097,Male,No,0,Graduate,Yes,11709,2450.0
98,LP1098,Male,No,2,Not Graduate,NaN,19215,180.0
99,LP1099,Male,No,0,Not Graduate,NaN,124930,NaN

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Loan_ID          100 non-null    object
 1   Gender           91 non-null     object
 2   Married          97 non-null     object
 3   Dependents       100 non-null    int64
 4   Education        100 non-null    object
 5   Self_Employed    83 non-null     object
 6   ApplicantIncome  100 non-null    int64
 7   LoanAmount       82 non-null     float64
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB